Table of Contents
 Class SteelSetupAISC
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Steel setup IBC class
public class SteelSetupAISC : SteelSetup
Inheritance
object
SteelSetup
SteelSetupAISC
Inherited Members
 SteelSetup.FrictionCoefficientPboltDefault()
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 BoltBearing_Omega
Safety factor BoltBearing_Omega
public double BoltBearing_Omega { get; set; }
Property Value
double
 BoltBearing_Phi
Safety factor BoltBearing_Phi
public double BoltBearing_Phi { get; set; }
Property Value
double
 BoltSlipRes_Omega
Safety factor BoltSlipRes_Phi
public double BoltSlipRes_Omega { get; set; }
Property Value
double
 BoltSlipRes_Phi
Safety factor BoltSlipRes_Phi
public double BoltSlipRes_Phi { get; set; }
Property Value
double
 BoltTensileShearCombined_Omega
Safety factor BoltTensileShearCombined_Omega
public double BoltTensileShearCombined_Omega { get; set; }
Property Value
double
 BoltTensileShearCombined_Phi
Safety factor BoltTensileShearCombined_Phi
public double BoltTensileShearCombined_Phi { get; set; }
Property Value
double
 BoltTensileShear_Omega
Safety factor BoltTensileShear_Omega
public double BoltTensileShear_Omega { get; set; }
Property Value
double
 BoltTensileShear_Phi
Safety factor BoltTensileShear_Phi
public double BoltTensileShear_Phi { get; set; }
Property Value
double
 FilletWelds_Omega
Safety factor FilletWelds_Omega
public double FilletWelds_Omega { get; set; }
Property Value
double
 FilletWelds_Phi
Safety factor FilletWelds_Phi
public double FilletWelds_Phi { get; set; }
Property Value
double
 MaterialFy_Omega
Safety factor MaterialFy_Omega
public double MaterialFy_Omega { get; set; }
Property Value
double
 MaterialFy_Phi
Safety factor MaterialFy_Phi
public double MaterialFy_Phi { get; set; }
Property Value
double
 ReductionFactorShear
ACI 318
public double ReductionFactorShear { get; set; }
Property Value
double
 ReductionFactorTension
ACI 318
public double ReductionFactorTension { get; set; }
Property Value
double
 Edit this page